[
  {
    "id": "creator-roadmap-2025-summer",
    "title": "Creator Roadmap (лето 2025): 40 фич, 1400 багфиксов и планы до RDC",
    "date": "2025-08-14",
    "category": "Обновления",
    "image": "images/cover-updates.png",
    "excerpt": "Roblox подвёл итоги лета: 40 доставленных пунктов, 1400 закрытых багов, новые инструменты UI, Avatar Settings, Cube 3D и аналитика.",
    "content": "<p>Команда Roblox опубликовала летнее обновление дорожной карты. С момента прошлого апдейта доставлено 40 пунктов, закрыто свыше 1400 багов и добавлено 18 новых задач. Среди заметных вещей: каталог лицензий IP, <em>UI Styling</em>, <em>Avatar Settings</em>, улучшения <em>Cube 3D</em>, комментарии прямо в Studio и новые отчёты аналитики.</p><p>В работе остаётся 200+ пунктов (включая Custom Matchmaking и Server Authority), подробности по части анонсов обещают на RDC.</p>",
    "tags": ["Roadmap", "Studio", "Аналитика"]
  },
  {
    "id": "safety-policy-aug-2025",
    "title": "Усиление правил и инструментов безопасности",
    "date": "2025-08-16",
    "category": "Безопасность",
    "image": "images/cover-news.png",
    "excerpt": "Уточнение политик, автоматическое обнаружение нарушений и ограничения для контента с «частными пространствами».",
    "content": "<p>Roblox объявил об обновлении политики и инструментов модерации. Вводятся: 1) уточнения правил и более продвинутые методы детекции нарушений, 2) допуск к социальным «хэнгаутам» с частными пространствами (спальни/ванные) — только для ID-верифицированных 17+, 3) ужесточение требований к <em>unrated</em> опытам, 4) расширение обратной связи с создателями. Также готовится функциональность <em>Violative Scenes Detection</em> для автоотключения серверов с пользовательскими нарушениями.</p>",
    "tags": ["Policy", "Moderation", "17+"]
  },
  {
    "id": "auto-translation-results",
    "title": "Автоперевод: результаты эксперимента и следующий шаг",
    "date": "2025-08-13",
    "category": "Локализация",
    "image": "images/cover-guides.png",
    "excerpt": "Тест показал, что автоперевод помогает поиску и удержанию; скоро — настройка для включения перевода на стороне игрока.",
    "content": "<p>Roblox подвёл итоги эксперимента по автопереводу отсутствующих строк в опытах. По данным команды, автоперевод увеличил обнаруживаемость и вовлечённость игроков в опытах без собственных переводов. В ближайшие недели появится настройка аккаунта, позволяющая игроку включать автоматический перевод строк в любых не локализованных опытах (ручные переводы при этом имеют приоритет).</p>",
    "tags": ["Локализация", "Перевод", "Поиск"]
  },
  {
    "id": "ugc-emotes-marketplace",
    "title": "UGC-эмоции: публикуй и продавай свои эмоты",
    "date": "2025-08-07",
    "category": "Маркетплейс",
    "image": "images/cover-news.png",
    "excerpt": "Создатели могут загружать кастомные «эмоты» и продавать их в Marketplace и внутри игр. Введены валидация и стандартные сборы.",
    "content": "<p>Теперь авторы могут публиковать и продавать собственные эмоты (короткие анимации аватара). Доступна валидация для защиты от эксплойтов и ограничение длительности до 10 секунд. Сборы: загрузка — 750 Robux, <em>publishing advance</em> — 1500 Robux для Non-Limited и 10000 Robux для Limited. Эмоты можно искать в Marketplace и покупать внутри опыта. Соблюдение стандартов сообщества обязательно.</p>",
    "tags": ["UGC", "Анимации", "Монетизация"]
  },
  {
    "id": "custom-start-places-for-events",
    "title": "События: кастомная стартовая локация",
    "date": "2025-08-06",
    "category": "События",
    "image": "images/cover-events.png",
    "excerpt": "Для Experience Events можно указать отдельный старт-плейс: пришедшие через «Join Event» попадут прямо в ивент-хаб.",
    "content": "<p>Для событий в Creator Dashboard появился выбор стартовой локации. Игроки, заходящие через кнопку «Join Event» или RSVP, будут попадать в указанный плейс (в обычный плейс — только при входе через стандартную кнопку «Play» на странице опыта). Это упрощает запуск ивентов, квестов и спец-хабов.</p>",
    "tags": ["Ивенты", "Discovery", "UX"]
  },
  {
    "id": "verification-level-for-communities",
    "title": "Уровни верификации для сообществ",
    "date": "2025-08-06",
    "category": "Сообщества",
    "image": "images/cover-news.png",
    "excerpt": "Владельцы сообществ могут требовать верификацию аккаунта при вступлении: None, Low, Medium или High.",
    "content": "<p>Для борьбы со спамом и ботами введён параметр Verification Level в настройках Community: <strong>None</strong> (по умолчанию), <strong>Low</strong> (телефон, e-mail или ID), <strong>Medium</strong> (ID или телефон+e-mail), <strong>High</strong> (только ID). Требование применяется к новым вступлениям, на текущих участников не влияет.</p>",
    "tags": ["Группы", "Безопасность", "Верификация"]
  },
  {
    "id": "ads-manager-aug-2025",
    "title": "Ads Manager: цель «Acquire New Users» и непрерывные кампании",
    "date": "2025-08-05",
    "category": "Реклама",
    "image": "images/cover-news.png",
    "excerpt": "Новые цели для роста игр, персонализация Sponsored-блока на главной и поддержка кампаний без даты окончания.",
    "content": "<p>Roblox обновил Ads Manager: добавлена цель <em>Acquire New Users</em> (привлечение новых/давно не возвращавшихся игроков), появилась персонализация позиции блока Sponsored на главной (может подниматься выше), а кампании теперь можно запускать как <em>continuous</em> — без даты завершения. Также объявлены улучшения креативов и автооптимизация миниатюр.</p>",
    "tags": ["Discovery", "Реклама", "Рост"]
  },
  {
    "id": "oof-is-back",
    "title": "Легендарный «OOF» вернулся звуком по умолчанию",
    "date": "2025-07-31",
    "category": "Платформа",
    "image": "images/cover-news.png",
    "excerpt": "Оригинальный «OOF» снова по умолчанию для смерти персонажа (в играх без кастомного звука).",
    "content": "<p>Roblox вернул оригинальный звуковой эффект «OOF» в качестве дефолтного звука смерти. Обновление для ПК и консолей уже доступно (мобильные — с поэтапным выкатом). Авторы по-прежнему могут переопределять звук в своих сценариях или использовать альтернативные ассеты из Creator Store.</p>",
    "tags": ["Звуки", "Ностальгия"]
  },
  {
    "id": "avatar-settings-release",
    "title": "Avatar Settings: одинаковые хитбоксы и контроль внешности",
    "date": "2025-07-21",
    "category": "Studio",
    "image": "images/cover-news.png",
    "excerpt": "Новый раздел в Studio позволяет задать единый рост, коллизии и правила для одежды/аксессуаров — меньше скриптов, больше честной игры.",
    "content": "<p>В Roblox Studio появился интерфейс <em>Avatar Settings</em> с пресетами (<em>Player Choice</em> и <em>Consistent Gameplay</em>) и настройками роста, коллайдера и анимаций. Это помогает обеспечить одинаковые хитбоксы и честный геймплей без сложных кастомных решений. Управление аксессуарами и ограничителями также доступно из окна настроек.</p>",
    "tags": ["Avatars", "Геймдизайн", "Честность"]
  },
  {
    "id": "rdc-2025-dates",
    "title": "RDC 2025: 5–6 сентября, Сан-Хосе + Roblox Innovation Awards",
    "date": "2025-03-11",
    "category": "События",
    "image": "images/cover-events.png",
    "excerpt": "Ежегодная конференция разработчиков пройдёт 5–6 сентября в Сан-Хосе. В рамках RDC состоятся Roblox Innovation Awards.",
    "content": "<p>Roblox Developers Conference (RDC 2025) пройдёт в формате офлайн и онлайн 5–6 сентября в Сан-Хосе. В программе — сессии, демо, нетворкинг и анонсы о будущем платформы. 6 сентября на площадке пройдёт церемония Roblox Innovation Awards.</p>",
    "tags": ["RDC", "Конференция", "Награды"]
  }
]
